{
    "fr": {
        "valid_urls_message": "Tous les concours valides sont dans valid_urls.csv",
        "errorfile": "Fichier introuvable. Verifiez que le fichier est bien dans le meme dossier que le programme.",
        "errorlang": "Choix de langue invalide. Passage a l'anglais par defaut.",
        "seconds_per_url": "Entrez le temps en secondes entre chaque ouverture d'URL : ",
        "errortype": "Veuillez entrer un nombre entier pour le temps en secondes.",
        "update_choice": "Voulez-vous mettre a jour les concours pour ne garder que les valides ? (yes/no) : ",
        "csv_file_name": "Entrez la liste (avec l'extension du fichier en .csv): ",
        "erroranswer": "Reponse invalide. Veuillez repondre par 'Oui' ou 'Non'.",
        "reponse": "Etes-vous pret a commencer ? (Oui/Non) ",
        "yes": "Oui",
        "no": "Non",
        "explications": "Voici quelques explications sur la suite du processus : \nLe programme va commencer a ouvrir les pages une par une avec les concours, il faudra cliquer sur le bouton orange au centre de l'ecran.",
        "begin": "Debut du programme...",
        "endmessage": "{} URLs ont ete ouvertes en environ {} secondes."
    },
    "en": {
        "valid_urls_message": "All valid giveaways are in valid_urls.csv",
        "errorfile": "File not found. Make sure the file is in the same folder as the program.",
        "errorlang": "Invalid language choice. Defaulting to English.",
        "seconds_per_url": "Enter the time in seconds between each URL opening: ",
        "errortype": "Please enter an integer for the time in seconds.",
        "update_choice": "Do you want to update the giveaways to only keep valid ones? (yes/no): ",
        "csv_file_name": "Enter the list (with the file extension in .csv): ",
        "erroranswer": "Invalid response. Please answer with 'Yes' or 'No'.",
        "reponse": "Are you ready to start? (Yes/No) ",
        "yes": "Yes",
        "no": "No",
        "explications": "Here are some explanations on the rest of the process: \nThe program will start to open the pages one by one with the competitions.",
        "begin": "Start of the program...",
        "endmessage": "{} URLs were opened in approximately {} seconds."
    }
}
